public class FavoriteSong {
    public static void main(String[] args) {
        System.out.println("Моя жизнь — это мультики про дураков\n" +
                "И мне хочется выключить — осточертело, но\n" +
                "Пульт в целлофане — он где-то в диване\n" +
                "Я шарю рукой его грузное тело\n" +
                "Глаза покрываются корочкой хлеба\n" +
                "И чувство, как будто жуешь полотенце\n" +
                "Где роли пусты, интриги нелепы\n" +
                "Мне не интересно");
    }
}
